#include <bits/stdc++.h>
using namespace std;

int main()
{
    int a1,b1,a2,b2;
    int x1,y1,x2,y2;
    cout <<"Размеры сторон первого прямоугольника и его координаты:";
    cin>>a1>>b1>>x1>>y1;
    cout <<"Размеры сторон второго прямоугольника и его координаты:";
    cin>>a2>>b2>>x2>>y2;
    if (a1*b1>a2*b2)
        cout<<"Координаты второго прямоугольника:("<<x2<<" "<<y2<<")"<<" ("<<x2+a2<<" "<<y2+b2<<")";
    else
        cout<<"Координаты первого прямоугольника:("<<x1<<" "<<y1<<")"<<" ("<<x1+a1<<" "<<y1+b1<<")";
}
